# Before you start :
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the IronHack database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [82]:
# import libraries here
import pandas as pd
import irondb

# Challenge 1

#### In this challenge we will use the `Temp_States`  database. 

#### First import it into a data frame called `temp`.

In [84]:
# your answer here
temp = irondb.sql_get('temp_states','temp_states')

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

#### Print `temp`

In [85]:
print(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the Temp dataframe. What type of data do we have? Comment your result.

In [5]:
# your answer here
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
City           7 non-null object
State          7 non-null object
Temperature    7 non-null float64
dtypes: float64(1), object(2)
memory usage: 248.0+ bytes

#### Select the rows where state is New York

In [7]:
# your answer here
temp[temp['State'] == 'New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average of the temperature of cities in New York?

In [8]:
# your answer here
temp[temp['State'] == 'New York'].mean()

Temperature    10.740741
dtype: float64

#### We want to know cities and states with Temperature above 15 degress Celcius

In [9]:
# your answer here
temp[temp['Temperature'] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degress Celcius

In [10]:
# your answer here
temp[temp['Temperature'] > 15]['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### We want to know which cities have a temperature above 15 degrees Celcius and below 20 degrees Celcius

*Hint: First write the condition then select the rows.*

In [16]:
# your answer here
temp[temp['Temperature'] > 15][temp['Temperature'] < 20]['City']

/usr/local/Cellar/ipython/7.2.0/libexec/vendor/lib/python3.7/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and the standard deviation of the temperature of each state.

*Hint: Use functions from Data Manipulation lesson*

In [19]:
# your answer here
temp.groupby('State').mean()

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

In [20]:
temp.groupby('State').std()

             Temperature
State
Connecticut     1.964186
New Jersey      1.571348
New York        8.133404

# Challenge 2

#### Load the `employees` database into a DataFrame. Call the dataframe `employees`

In [86]:
# your answer here 
employees = irondb.sql_get('employees','employees')

#### Explore the data types of the Employees dataframe. Comment your results

In [24]:
# your answer here
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
Name          9 non-null object
Department    9 non-null object
Education     9 non-null object
Gender        9 non-null object
Title         9 non-null object
Years         9 non-null int64
Salary        9 non-null int64
dtypes: int64(2), object(5)
memory usage: 584.0+ bytes

#### What's the average salary in this company?

In [25]:
# your answer here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [26]:
# your answer here
employees['Salary'].max()

70

#### What's the lowest salary?

In [27]:
# your answer here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [31]:
# your answer here
employees[employees['Salary'] == 30]['Name']

1    Maria
2    David
Name: Name, dtype: object

#### Could you give all the information about an employee called David?

In [32]:
# your answer here
employees[employees['Name'] == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you give only David's salary?

In [33]:
# your answer here
employees[employees['Name'] == 'David']['Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate

In [35]:
# your answer here
employees[employees['Title'] == 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe

##### Tip : There are 2 ways to do it. Do it both ways

In [36]:
# your answer here- 1 method
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [37]:
# your answer here- 2nd method
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees who's title is associate and the salary above 55?

In [38]:
# your answer here
employees[employees['Title'] == 'associate'][employees['Salary'] > 55]

/usr/local/Cellar/ipython/7.2.0/libexec/vendor/lib/python3.7/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees based on their number of years of employment. What are the average salaries in each group?

In [39]:
# your answer here
employees.groupby('Years').mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average Salary per title?

In [40]:
# your answer here
employees.groupby('Title').mean()

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

####  What are the Salary quartiles?

In [42]:
# print first quartile here
employees['Salary'].quantile(0.25)

35.0

In [43]:
# print third quartile here
employees['Salary'].quantile(0.75)

60.0

#### Is the mean salary per gender different?

In [45]:
# your answer here
employees.groupby('Gender').mean()

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

#### Find the minimum, mean and the maximum of all numeric columns for each Department.

In [68]:
# your answer here
employees.groupby('Department').describe()

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

### Bonus Question

#### For each department, compute the difference between the maximal salary and the minimal salary.

##### * Hint: try using `agg` or `apply` and `lambda`*

In [66]:
# your answer here
employees.groupby('Department')['Salary'].apply(lambda x: max(x) - min(x))

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# Challenge 3

#### Open the Orders dataset. Name your dataset orders

In [87]:
# your answer here
orders = irondb.sql_get('orders','orders')

#### Explore your dataset by looking at the data types and the summary statistics. Comment your results

In [108]:
# your answer here
orders.head()

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [89]:
# your answer here
orders.describe()

,index,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,198961.500000,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,114870.908596,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,99480.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,198961.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,298442.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,397923.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

####  What is the average Purchase Price?

In [90]:
# your answer here
orders['UnitPrice'].mean()

3.1161744805540756

#### What were the highest and lowest purchase prices?

In [91]:
# your answer here
orders['UnitPrice'].max()

8142.75

In [92]:
# your answer here
orders['UnitPrice'].min()

0.0

#### Select all the customers we have in Spain

In [94]:
# your answer here
orders[orders['Country'] == 'Spain']

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
4250,4250,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4251,4251,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
4252,4252,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.00
4253,4253,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4254,4254,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
13974,13974,538095,22504,2010,12,4,14,cabin bag vintage retrospot,1,2010-12-09 14:55:00,29.95,17097,Spain,29.95
13975,13975,538095,22212,2010,12,4,14,four hook white lovebirds,1,2010-12-09 14:55:00,2.10,17097,Spain,2.10
13976,13976,538095,22953,2010,12,4,14,birthday party cordon barrier tape,1,2010-12-09 14:55:00,1.25,17097,Spain,1.25
13977,13977,538095,84818,2010,12,4,14,danish rose photo frame,1,2010-12-09 14:55:00,2.55,17097,Spain,2.55
13978,13978,538095,21114,2010,12,4,14,lavender scented fabric heart,5,2010-12-09 14:55:00,1.25,17097,Spain,6.25
13979,13979,538095,84692,2010,12,4,14,box of 24 cocktail parasols,1,2010-12-09 14:55:00,0.42,17097,Spain,0.42
13980,13980,538095,22796,2010,12,4,14,photo frame 3 classic hanging,2,2010-12-09 14:55:00,9.95,17097,Spain,19.90
13981,13981,538095,40001,2010,12,4,14,white bamboo ribs lampshade,1,2010-12-09 14:55:00,0.85,17097,Spain,0.85
13982,13982,538095,22646,2010,12,4,14,ceramic strawberry cake money bank,1,2010-12-09 14:55:00,1.45,17097,Spain,1.45
13983,13983,538095,21883,2010,12,4,14,stars gift tape,2,2010-12-09 14:55:00,0.65,17097,Spain,1.30
13984,13984,538095,21879,2010,12,4,14,hearts gift tape,2,2010-12-09 14:55:00,0.65,17097,Spain,1.30
13985,13985,538095,22494,2010,12,4,14,emergency first aid tin,2,2010-12-09 14:55:00,1.25,17097,Spain,2.50
13986,13986,538095,47566,2010,12,4,14,party bunting,1,2010-12-09 14:55:00,4.65,17097,Spain,4.65
13987,13987,538095,85123A,2010,12,4,14,white hanging heart t-light holder,1,2010-12-09 14:55:00,2.95,17097,Spain,2.95
13988,13988,538095,21430,2010,12,4,14,set/3 red gingham rose storage box,1,2010-12-09 14:55:00,3.75,17097,Spain,3.75
13989,13989,538095,22914,2010,12,4,14,blue coat rack paris fashion,1,2010-12-09 14:55:00,4.95,17097,Spain,4.95
13990,13990,538095,22913,2010,12,4,14,red coat rack paris fashion,1,2010-12-09 14:55:00,4.95,17097,Spain,4.95
13991,13991,538095,22912,2010,12,4,14,yellow coat rack paris fashion,1,2010-12-09 14:55:00,4.95,17097,Spain,4.95
13992,13992,538095,22631,2010,12,4,14,circus parade lunch box,1,2010-12-09 14:55:00,1.95,17097,Spain,1.95
13993,13993,538095,22497,2010,12,4,14,set of 2 tins vintage bathroom,2,2010-12-09 14:55:00,4.25,17097,Spain,8.50
13994,13994,538095,22909,2010,12,4,14,set of 20 vintage christmas napkins,2,2010-12-09 14:55:00,0.85,17097,Spain,1.70
13995,13995,538095,22862,2010,12,4,14,love heart napkin box,1,2010-12-09 14:55:00,4.25,17097,Spain,4.25
13996,13996,538095,22726,2010,12,4,14,alarm clock bakelike green,2,2010-12-09 14:55:00,3.75,17097,Spain,7.50
13997,13997,538095,20828,2010,12,4,14,glitter butterfly clips,1,2010-12-09 14:55:00,2.55,17097,Spain,2.55
13998,13998,538095,20829,2010,12,4,14,glitter hanging butterfly string,1,2010-12-09 14:55:00,2.10,17097,Spain,2.10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
394708,394708,581193,23452,2011,12,3,17,heart mini portrait frame,2,2011-12-07 17:05:00,1.95,17097,Spain,3.90
394709,394709,581193,22907,2011,12,3,17,pack of 20 napkins pantry design,1,2011-12-07 17:05:00,0.85,17097,Spain,0.85
394710,394710,581193,22851,2011,12,3,17,set 20 napkins fairy cakes design,1,2011-12-07 17:05:00,0.85,17097,Spain,0.85
394711,394711,581193,23209,2011,12,3,17,lunch bag vintage doily,1,2011-12-07 17:05:00,1.65,17097,Spain,1.65
394712,394712,581193,22662,2011,12,3,17,lunch bag dolly girl design,1,2011-12-07 17:05:00,1.65,17097,Spain,1.65
394713,394713,581193,23583,2011,12,3,17,lunch bag paisley park,1,2011-12-07 17:05:00,1.65,17097,Spain,1.65
394714,394714,581193,22896,2011,12,3,17,peg bag apples design,1,2011-12-07 17:05:00,2.55,17097,Spain,2.55
394715,394715,581193,23203,2011,12,3,17,jumbo bag vintage doily,1,2011-12-07 17:05:00,2.08,17097,Spain,2.08
394716,394716,581193,22393,2011,12,3,17,paperweight vintage collage,2,2011-12-07 17:05:00,0.39,17097,Spain,0.78
394717,394717,581193,22391,2011,12,3,17,paperweight home sweet home,2,2011-12-07 17:05:00,0.39,17097,Spain,0.78
394718,394718,581193,23454,2011,12,3,17,three mini hanging frames,1,2011-12-07 17:05:00,4.15,17097,Spain,4.15
394719,394719,581193,84536A,2011,12,3,17,english rose notebook a7 size,2,2011-12-07 17:05:00,0.42,17097,Spain,0.84
394720,394720,581193,84535B,2011,12,3,17,fairy cakes notebook a6 size,2,2011-12-07 17:05:00,0.65,17097,Spain,1.30
394721,394721,581193,22755,2011,12,3,17,small purple babushka notebook,1,2011-12-07 17:05:00,0.21,17097,Spain,0.21
394722,394722,581193,22753,2011,12,3,17,small yellow babushka notebook,1,2011-12-07 17:05:00,0.21,17097,Spain,0.21
394723,394723,581193,22754,2011,12,3,17,small red babushka notebook,1,2011-12-07 17:05:00,0.21,17097,Spain,0.21
394724,394724,581193,23372,2011,12,3,17,set 36 colour pencils dolly girl,1,2011-12-07 17:05:00,1.25,17097,Spain,1.25
394725,394725,581193,23371,2011,12,3,17,set 36 colour pencils spaceboy,1,2011-12-07 17:05:00,1.25,17097,Spain,1.25
394726,394726,581193,23254,2011,12,3,17,childrens cutlery dolly girl,1,2011-12-07 17:05:00,4.15,17097,Spain,4.15
394727,394727,581193,22326,2011,12,3,17,round snack boxes set of4 woodland,2,2011-12-07 17:05:00,2.95,17097,Spain,5.90
394728,394728,581193,22629,2011,12,3,17,spaceboy lunch box,1,2011-12-07 17:05:00,1.95,17097,Spain,1.95
394729,394729,581193,22631,2011,12,3,17,circus parade lunch box,1,2011-12-07 17:05:00,1.95,17097,Spain,1.95
394730,394730,581193,23290,2011,12,3,17,spaceboy childrens bowl,2,2011-12-07 17:05:00,1.25,17097,Spain,2.50
394731,394731,581193,23289,2011,12,3,17,dolly girl childrens bowl,2,2011-12-07 17:05:00,1.25,17097,Spain,2.50
394732,394732,581193,23292,2011,12,3,17,spaceboy childrens cup,2,2011-12-07 17:05:00,1.25,17097,Spain,2.50
394733,394733,581193,23291,2011,12,3,17,dolly girl childrens cup,2,2011-12-07 17:05:00,1.25,17097,Spain,2.50
394734,394734,581193,85232D,2011,12,3,17,set/3 decoupage stacking tins,1,2011-12-07 17:05:00,4.95,17097,Spain,4.95
394735,394735,581193,22721,2011,12,3,17,set of 3 cake tins sketchbook,2,2011-12-07 17:05:00,1.95,17097,Spain,3.90
394736,394736,581193,23241,2011,12,3,17,treasure tin gymkhana design,1,2011-12-07 17:05:00,2.08,17097,Spain,2.08
394737,394737,581193,23247,2011,12,3,17,biscuit tin 50 s christmas,1,2011-12-07 17:05:00,2.89,17097,Spain,2.89

#### How many customers do we have in Spain?
##### Hint : Use value_counts() method

In [97]:
# your answer here
orders['Country'].value_counts()['Spain']

2485

#### Select all the customers who have bought more than 50 items ?

In [116]:
# your answer here
orders[orders['Quantity'] > 50].groupby('CustomerID').sum().sort_values('Quantity',ascending = False)['Quantity']

CustomerID
14646    178598
16446     80995
12346     74215
12415     70824
17450     66025
18102     61136
13694     56417
17511     50478
16684     48555
14156     44325
16029     37513
16333     32184
17404     31640
17949     30123
15769     29356
12931     27824
16422     27420
15311     26238
17381     24956
14298     24748
15061     22386
12901     21495
17857     19194
13798     18369
15749     18028
14911     17306
13027     17280
15838     16016
16013     13750
13256     12540
          ...
14432        60
15834        60
15026        60
13126        60
15036        60
17244        60
15529        60
15990        60
13458        60
16146        60
15738        60
14916        60
14059        60
18287        60
17994        60
13505        60
14377        60
14390        60
16407        60
12709        60
14597        58
15901        58
18217        56
12603        56
14735        56
16242        54
13978        54
17267        54
13162        54
14415        53
Name: Quantity, Length: 1301, dtype: int64

#### Select orders from Spain that are above 50 items

In [128]:
# your answer here
orders[(orders.Quantity > 50) & (orders.Country == 'Spain')]

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
4250,4250,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4251,4251,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
4252,4252,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.00
4253,4253,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4254,4254,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
32454,32454,540785,84997B,2011,1,2,11,red 3 piece retrospot cutlery set,144,2011-01-11 11:39:00,3.39,12557,Spain,488.16
32455,32455,540785,84997D,2011,1,2,11,pink 3 piece polkadot cutlery set,360,2011-01-11 11:39:00,3.39,12557,Spain,1220.40
32456,32456,540785,84997C,2011,1,2,11,blue 3 piece polkadot cutlery set,360,2011-01-11 11:39:00,3.39,12557,Spain,1220.40
32457,32457,540785,84997A,2011,1,2,11,green 3 piece polkadot cutlery set,144,2011-01-11 11:39:00,3.39,12557,Spain,488.16
91155,91155,547972,22383,2011,3,1,16,lunch bag suki design,150,2011-03-28 16:41:00,1.45,12557,Spain,217.50
91156,91156,547972,22384,2011,3,1,16,lunch bag pink polkadot,150,2011-03-28 16:41:00,1.45,12557,Spain,217.50
91159,91159,547972,20728,2011,3,1,16,lunch bag cars blue,150,2011-03-28 16:41:00,1.45,12557,Spain,217.50
174442,174442,558871,22384,2011,7,1,13,lunch bag pink polkadot,100,2011-07-04 13:19:00,1.45,12557,Spain,145.00
174443,174443,558871,20727,2011,7,1,13,lunch bag black skull.,100,2011-07-04 13:19:00,1.45,12557,Spain,145.00
174444,174444,558871,20725,2011,7,1,13,lunch bag red retrospot,100,2011-07-04 13:19:00,1.45,12557,Spain,145.00
174445,174445,558871,20728,2011,7,1,13,lunch bag cars blue,100,2011-07-04 13:19:00,1.45,12557,Spain,145.00
174446,174446,558871,84997B,2011,7,1,13,childrens cutlery retrospot red,72,2011-07-04 13:19:00,3.75,12557,Spain,270.00
174447,174447,558871,84997D,2011,7,1,13,childrens cutlery polkadot pink,360,2011-07-04 13:19:00,3.75,12557,Spain,1350.00
174448,174448,558871,84997C,2011,7,1,13,childrens cutlery polkadot blue,360,2011-07-04 13:19:00,3.75,12557,Spain,1350.00
174449,174449,558871,84997A,2011,7,1,13,childrens cutlery polkadot green,72,2011-07-04 13:19:00,3.75,12557,Spain,270.00
197167,197167,561669,23295,2011,7,4,17,set of 12 mini loaf baking cases,128,2011-07-28 17:09:00,0.72,12507,Spain,92.16
197168,197168,561669,23297,2011,7,4,17,set 40 heart shape petit four cases,144,2011-07-28 17:09:00,1.45,12507,Spain,208.80
197169,197169,561669,23294,2011,7,4,17,set of 6 snack loaf baking cases,128,2011-07-28 17:09:00,0.72,12507,Spain,92.16
197170,197170,561669,23296,2011,7,4,17,set of 6 tea time baking cases,128,2011-07-28 17:09:00,1.04,12507,Spain,133.12
197171,197171,561669,23293,2011,7,4,17,set of 12 fairy cake baking cases,128,2011-07-28 17:09:00,0.72,12507,Spain,92.16
224881,224881,564734,84826,2011,8,7,13,asstd design 3d paper stickers,60,2011-08-28 13:32:00,0.85,12484,Spain,51.00
254097,254097,567968,85204,2011,9,5,9,hanging wood and felt flower,96,2011-09-23 09:44:00,0.12,12546,Spain,11.52
289129,289129,571255,82494L,2011,10,5,17,wooden frame antique white,72,2011-10-14 17:13:00,2.55,12454,Spain,183.60
289134,289134,571255,82482,2011,10,5,17,wooden picture frame white finish,72,2011-10-14 17:13:00,2.55,12454,Spain,183.60
289142,289142,571255,72802B,2011,10,5,17,ocean scent candle in jewelled box,200,2011-10-14 17:13:00,1.25,12454,Spain,250.00
289143,289143,571255,72802C,2011,10,5,17,vanilla scent candle jewelled box,288,2011-10-14 17:13:00,1.25,12454,Spain,360.00
295956,295956,571851,23167,2011,10,3,13,small ceramic top storage jar,96,2011-10-19 13:02:00,0.69,12596,Spain,66.24
312655,312655,573362,22598,2011,10,7,13,christmas musical zinc tree,72,2011-10-30 13:06:00,0.29,12597,Spain,20.88
312656,312656,573362,22597,2011,10,7,13,musical zinc heart decoration,72,2011-10-30 13:06:00,0.29,12597,Spain,20.88
312657,312657,573362,22599,2011,10,7,13,christmas musical zinc star,72,2011-10-30 13:06:00,0.29,12597,Spain,20.88
366326,366326,578321,20728,2011,11,3,16,lunch bag cars blue,200,2011-11-23 16:59:00,1.45,12557,Spain,290.00
366327,366327,578321,84997B,2011,11,3,16,childrens cutlery retrospot red,72,2011-11-23 16:59:00,3.75,12557,Spain,270.00
366328,366328,578321,84997D,2011,11,3,16,childrens cutlery polkadot pink,360,2011-11-23 16:59:00,3.75,12557,Spain,1350.00
366329,366329,578321,84997C,2011,11,3,16,childrens cutlery polkadot blue,288,2011-11-23 16:59:00,3.75,12557,Spain,1080.00

#### Select all free orders

In [ ]:
# your answer here
orders[]

#### Select all orders that are 'lunch bag'
#### Hint: Use string functions

In [ ]:
# your answer here

#### Select all orders that are made in 2011 and are 'lunch bag'

In [ ]:
# your answer here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your answer here

#### Select all orders made in the month of August

In [ ]:
# your answer here

#### Select how many orders are made by countries in the month of August
##### Hint: Use value_counts()

In [ ]:
# your answer here

#### What's the  average amount of money spent by country

In [ ]:
# your answer here

#### What's the most expensive item?

In [ ]:
# your answer here

#### What was the average amount spent per year ?

In [ ]:
# your answer here